#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_project.project["gcp-allex-vpc"] will be created
  + resource "google_project" "project" {
      + auto_create_network = true
      + billing_account     = "014D0D-FC86D0-4DECE5"
      + folder_id           = "462162860246"
      + id                  = (known after apply)
      + labels              = {
          + "branded_bu" = "techforall"
          + "owner_id"   = "jtihin"
          + "team_dl"    = "publiccloud-engineering"
          + "usecase"    = "test_project_for_tfe"
        }
      + name                = "gcp-allex-vpc"
      + number              = (known after apply)
      + project_id          = "gcp-allex-vpc"
      + skip_delete         = (known after apply)
    }

  # google_project.project["jithin-terraform-allex"] will be created
  + resource "google_project" "project" {
      + auto_create_network = true
      + billing_account     = "014D0D-FC86D0-4DECE5"
      + folder_id           = "24734950673"
      + id                  = (known after apply)
      + labels              = {
          + "branded_bu" = "techforall"
          + "owner_id"   = "jtihin"
          + "team_dl"    = "publiccloud-engineering"
          + "usecase"    = "test_project_for_tfe"
        }
      + name                = "jithin-terraform-allex"
      + number              = (known after apply)
      + project_id          = "jithin-terraform-allex"
      + skip_delete         = (known after apply)
    }

  # google_project_service.service["gcp-allex-vpc.binaryauthorization.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "gcp-allex-vpc"
      + service                    = "binaryauthorization.googleapis.com"
    }

  # google_project_service.service["gcp-allex-vpc.cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "gcp-allex-vpc"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.service["gcp-allex-vpc.compute.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "gcp-allex-vpc"
      + service                    = "compute.googleapis.com"
    }

  # google_project_service.service["gcp-allex-vpc.logging.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "gcp-allex-vpc"
      + service                    = "logging.googleapis.com"
    }

  # google_project_service.service["gcp-allex-vpc.storage.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "gcp-allex-vpc"
      + service                    = "storage.googleapis.com"
    }

  # google_project_service.service["jithin-terraform-allex.cloudresourcemanager.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "jithin-terraform-allex"
      + service                    = "cloudresourcemanager.googleapis.com"
    }

  # google_project_service.service["jithin-terraform-allex.compute.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "jithin-terraform-allex"
      + service                    = "compute.googleapis.com"
    }

  # google_project_service.service["jithin-terraform-allex.logging.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "jithin-terraform-allex"
      + service                    = "logging.googleapis.com"
    }

  # google_project_service.service["jithin-terraform-allex.storage.googleapis.com"] will be created
  + resource "google_project_service" "service" {
      + disable_dependent_services = true
      + disable_on_destroy         = true
      + id                         = (known after apply)
      + project                    = "jithin-terraform-allex"
      + service                    = "storage.googleapis.com"
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + projects          = {
      + gcp-allex-vpc          = {
          + auto_create_network = true
          + billing_account     = "014D0D-FC86D0-4DECE5"
          + folder_id           = "462162860246"
          + id                  = (known after apply)
          + labels              = {
              + branded_bu = "techforall"
              + owner_id   = "jtihin"
              + team_dl    = "publiccloud-engineering"
              + usecase    = "test_project_for_tfe"
            }
          + name                = "gcp-allex-vpc"
          + number              = (known after apply)
          + org_id              = null
          + project_id          = "gcp-allex-vpc"
          + skip_delete         = (known after apply)
          + timeouts            = null
        }
      + jithin-terraform-allex = {
          + auto_create_network = true
          + billing_account     = "014D0D-FC86D0-4DECE5"
          + folder_id           = "24734950673"
          + id                  = (known after apply)
          + labels              = {
              + branded_bu = "techforall"
              + owner_id   = "jtihin"
              + team_dl    = "publiccloud-engineering"
              + usecase    = "test_project_for_tfe"
            }
          + name                = "jithin-terraform-allex"
          + number              = (known after apply)
          + org_id              = null
          + project_id          = "jithin-terraform-allex"
          + skip_delete         = (known after apply)
          + timeouts            = null
        }
    }
  + projects_services = {
      + "gcp-allex-vpc.binaryauthorization.googleapis.com"           = {
          + disable_dependent_services = true
          + disable_on_destroy         = true
          + id                         = (known after apply)
          + project                    = "gcp-allex-vpc"
          + service                    = "binaryauthorization.googleapis.com"
          + timeouts                   = null
        }
      + "gcp-allex-vpc.cloudresourcemanager.googleapis.com"          = {
          + disable_dependent_services = true
          + disable_on_destroy         = true
          + id                         = (known after apply)
          + project                    = "gcp-allex-vpc"
          + service                    = "cloudresourcemanager.googleapis.com"
          + timeouts                   = null
        }
      + "gcp-allex-vpc.compute.googleapis.com"                       = {
          + disable_dependent_services = true
          + disable_on_destroy         = true
          + id                         = (known after apply)
          + project                    = "gcp-allex-vpc"
          + service                    = "compute.googleapis.com"
          + timeouts                   = null
        }
      + "gcp-allex-vpc.logging.googleapis.com"                       = {
          + disable_dependent_services = true
          + disable_on_destroy         = true
          + id                         = (known after apply)
          + project                    = "gcp-allex-vpc"
          + service                    = "logging.googleapis.com"
          + timeouts                   = null
        }
      + "gcp-allex-vpc.storage.googleapis.com"                       = {
          + disable_dependent_services = true
          + disable_on_destroy         = true
          + id                         = (known after apply)
          + project                    = "gcp-allex-vpc"
          + service                    = "storage.googleapis.com"
          + timeouts                   = null
        }
      + "jithin-terraform-allex.cloudresourcemanager.googleapis.com" = {
          + disable_dependent_services = true
          + disable_on_destroy         = true
          + id                         = (known after apply)
          + project                    = "jithin-terraform-allex"
          + service                    = "cloudresourcemanager.googleapis.com"
          + timeouts                   = null
        }
      + "jithin-terraform-allex.compute.googleapis.com"              = {
          + disable_dependent_services = true
          + disable_on_destroy         = true
          + id                         = (known after apply)
          + project                    = "jithin-terraform-allex"
          + service                    = "compute.googleapis.com"
          + timeouts                   = null
        }
      + "jithin-terraform-allex.logging.googleapis.com"              = {
          + disable_dependent_services = true
          + disable_on_destroy         = true
          + id                         = (known after apply)
          + project                    = "jithin-terraform-allex"
          + service                    = "logging.googleapis.com"
          + timeouts                   = null
        }
      + "jithin-terraform-allex.storage.googleapis.com"              = {
          + disable_dependent_services = true
          + disable_on_destroy         = true
          + id                         = (known after apply)
          + project                    = "jithin-terraform-allex"
          + service                    = "storage.googleapis.com"
          + timeouts                   = null
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @jithinpnjm, Action: `pull_request`, Working Directory: ``, Workflow: `gcp_bootstrap_projects`*